[
  {
    "path": "posts/2022-01-25-data-visualization-with-tableau/",
    "title": "Data Visualization in Tableau vs. R",
    "description": "For my EDS240 Data Visualization and Communication course in the MEDS program, I explored data visualization using Tableau compared to RStudio. I used Moorea Coral Reef Long Term Ecological Reasearch (MCR LTER) site data on algea nitrogen content and coral bleaching observations in Moorea, Frech Polynesia. This data will be used in my MEDS Capstone Project. I also explored a helpful package called naniar for investigating missing data structures.",
    "author": [
      {
        "name": "Charles Hendrickson",
        "url": {}
      }
    ],
    "date": "2022-01-25",
    "categories": [
      "Tableau",
      "R",
      "tidyr",
      "ggplot",
      "naniar"
    ],
    "contents": "\nData Visualization Assignment\nCurrently in the MEDS program, I am taking EDS240 Data Visualization and Communication. Our second assignment was to create two data visualizations using Tableau, which is a data visualization and business intelligence tool used for reporting and analyzing data. For this post, I want to compare my data visualizations in Tableau versus RStudio and determine which one communicated my data better.\nLoading the data\nI will use the librarian package to load packages automatically at the start of my R session. I use the here package to easily build paths to my data file and use tidyverse, which is an amazing collection of open source R packages for data science. I also explore the naniar package to investigate missing data structures. Finally, I use RColorBrewer, which is an R package that uses the work from http://colorbrewer2.org/ to help you choose sensible color schemes for figures in R. The colors are split into three group, sequential, diverging, and qualitative.\n\n\nShow code\n\n# Load packages\nlibrarian::shelf(here, tidyverse, naniar, RColorBrewer)\n\n\n\n\n\nShow code\n\n# Here is some of the notation I will be using in my file paths to read in the data:\n\n# .    = this directory\n# ..   = the parent directory\n# ../  = the parent directory\n# ~/   = the user's home directory or the application's, in ASP\n# /    = the root directory\n\n# ../../ = the parent's parent directory\n\n\n\n\n\nShow code\n\n# Read in data\n# Includes nitrogen content and coral bleaching data collected from the Moorea Coral Reef Long Term Ecological Research (MCR LTER) site.\nMCR_LTER_bleaching_data <- read.csv(here(\"../data/MCR_LTER_Burkepile_Adams_2016_Coral_Bleaching_Survey_20191023.csv\"))\n\nMCR_LTER_Nitrogen_data <- read.csv(here(\"../data/MCR_LTER_Adam_EcolAp_N_summary_20200331.csv\"))\n\n\n\nInvestigating the data\nFirst, let’s check out the missing data values in the MCR-LTER bleaching data using the naniar package, which provides useful functions for examining initial missing value counts and proportions.\n\n\nShow code\n\n# Returns NA count in your data frame or column\nn_miss(MCR_LTER_bleaching_data)\n\n\n[1] 502\n\nShow code\n\n# Returns number of complete values\nn_complete(MCR_LTER_bleaching_data)\n\n\n[1] 132488\n\nShow code\n\n# Proportion or percentage of values that are NA\nprop_miss(MCR_LTER_bleaching_data) \n\n\n[1] 0.00377472\n\nShow code\n\npct_miss(MCR_LTER_bleaching_data)\n\n\n[1] 0.377472\n\nShow code\n\n# A summary table of NA counts in your table\nmiss_var_summary(MCR_LTER_bleaching_data)\n\n\n# A tibble: 13 × 3\n   variable          n_miss pct_miss\n   <chr>              <int>    <dbl>\n 1 avgTotN              241    2.36 \n 2 avgdN15              241    2.36 \n 3 Percent_bleached      20    0.196\n 4 Point                  0    0    \n 5 Latitude               0    0    \n 6 Longitude              0    0    \n 7 Island_shore           0    0    \n 8 Habitat                0    0    \n 9 LTER_site              0    0    \n10 Depth_m                0    0    \n11 Taxa                   0    0    \n12 Colony_size_class      0    0    \n13 cumstress              0    0    \n\nShow code\n\n# A summary table of NAs by case (observation)\nmiss_case_table(MCR_LTER_bleaching_data)\n\n\n# A tibble: 3 × 3\n  n_miss_in_case n_cases pct_cases\n           <int>   <int>     <dbl>\n1              0    9969    97.4  \n2              1      20     0.196\n3              2     241     2.36 \n\nThe summary table of NA counts in the data show us that there are 20 NA values in the Percent_bleached column, which is 0.1955034% of the values in that column. Knowing this, we can safely remove these NA values from the Percent_bleached column.\n\n\nShow code\n\n# Remove NA values \nMCR_LTER_bleaching_data_clean <- MCR_LTER_bleaching_data[!is.na(MCR_LTER_bleaching_data$Percent_bleached), ]\n\n# Confirm that NA's were removed from Percent_bleached column\npct_miss(MCR_LTER_bleaching_data_clean$Percent_bleached)\n\n\n[1] 0\n\nNext, let’s check out the missing data values in the MCR-LTER nitrogen summary data.\n\n\nShow code\n\n# Returns NA count in your data frame or column\nn_miss(MCR_LTER_Nitrogen_data)\n\n\n[1] 88\n\nShow code\n\n# Returns number of complete values\nn_complete(MCR_LTER_Nitrogen_data)\n\n\n[1] 2002\n\nShow code\n\n# Proportion or percentage of values that are NA\nprop_miss(MCR_LTER_Nitrogen_data) \n\n\n[1] 0.04210526\n\nShow code\n\npct_miss(MCR_LTER_Nitrogen_data)\n\n\n[1] 4.210526\n\nShow code\n\n# A summary table of NA counts in your table\nmiss_var_summary(MCR_LTER_Nitrogen_data)\n\n\n# A tibble: 11 × 3\n   variable       n_miss pct_miss\n   <chr>           <int>    <dbl>\n 1 d15NNorm_July      21    11.1 \n 2 Percent_N_May      19    10   \n 3 d15NNorm_May       19    10   \n 4 Percent_N_July     17     8.95\n 5 Percent_N_Jan       6     3.16\n 6 d15NNorm_Jan        6     3.16\n 7 Point               0     0   \n 8 Latitude            0     0   \n 9 Longitude           0     0   \n10 Island_shore        0     0   \n11 Habitat             0     0   \n\nShow code\n\n# A summary table of NAs by case (observation)\nmiss_case_table(MCR_LTER_Nitrogen_data)\n\n\n# A tibble: 5 × 3\n  n_miss_in_case n_cases pct_cases\n           <int>   <int>     <dbl>\n1              0     150    78.9  \n2              1       5     2.63 \n3              2      28    14.7  \n4              3       1     0.526\n5              4       6     3.16 \n\nThe summary table of NA counts in the Nitrogen data show us that there are:\n19 NA values in the Percent_N_May column, which is 10% of the values in that column 17 NA values in the Percent_N_July column, which is 8.94% of the values in that column 6 NA values in the Percent_N_Jan column, which is 3.15% of the values in that column\nKnowing this, we can safely remove these NA values from each of these columns.\n\n\nShow code\n\n# Remove NA values \nMCR_LTER_Nitrogen_data_clean <- \n  MCR_LTER_Nitrogen_data[!is.na(MCR_LTER_Nitrogen_data$Percent_N_May) &            !is.na(MCR_LTER_Nitrogen_data$Percent_N_Jan) &\n!is.na(MCR_LTER_Nitrogen_data$Percent_N_July),]\n\n# Confirm that NA's were removed from each column\npct_miss(MCR_LTER_Nitrogen_data_clean$Percent_N_May)\n\n\n[1] 0\n\nShow code\n\n# Confirm that NA's were removed from each column\npct_miss(MCR_LTER_Nitrogen_data_clean$Percent_N_Jan)\n\n\n[1] 0\n\nShow code\n\n# Confirm that NA's were removed from each column\npct_miss(MCR_LTER_Nitrogen_data_clean$Percent_N_July)\n\n\n[1] 0\n\nWrangling the data\nHere I will find the average percent of the colony area that was bleached for sites at each cardinal direction of shoreline (N, SE, SW) and for each species\n\n\nShow code\n\n# Find the average percent of the colony area that was bleached for sites at each cardinal direction of shoreline (N, SE, SW) and for each species\navg_percent_bleached <- MCR_LTER_bleaching_data_clean %>%\n  group_by(Habitat, Island_shore) %>% \n  summarise(Avg_percent_bleached = mean(Percent_bleached))\n\n\n\nNext I will find the average percent nitrogen in Turbinaria ornata for each month and habitat type\n\n\nShow code\n\n# Find the average percent nitrogen in Turbinaria ornata for each month \n\n# Average percent nitrogen for January \navg_percent_N_jan <- MCR_LTER_Nitrogen_data_clean %>%\n  group_by(Habitat) %>% \n  summarise(avg_percent_N = mean(Percent_N_Jan)) %>% \n  mutate(month = \"January\")\n\n# Average percent nitrogen for May \navg_percent_N_may <- MCR_LTER_Nitrogen_data_clean %>%\n  group_by(Habitat) %>% \n  summarise(avg_percent_N = mean(Percent_N_May)) %>%\n  mutate(month = \"May\")\n\n\n# Average percent nitrogen for July\navg_percent_N_july <- MCR_LTER_Nitrogen_data_clean %>%\n  group_by(Habitat) %>% \n  summarise(avg_percent_N = mean(Percent_N_July)) %>% \n  mutate(month = \"July\")\n\n\n# Then, I will join the data frames together, starting with January and May. The full_join() retains all rows and all values\navg_percent_N_jan_may <- full_join(avg_percent_N_jan, avg_percent_N_may, by = c(\"Habitat\", \"avg_percent_N\", \"month\"))\n\n# Finally, I will join July to the data frame containing January and May observations with full_join() to get our final dataset for the average percent nitrogen in Turbinaria ornata for each month and habitat type.\n\navg_percent_N_complete <- full_join(avg_percent_N_jan_may, avg_percent_N_july, by = c(\"Habitat\", \"avg_percent_N\", \"month\"))\n\n# I will also order the \"month\" categories chronologically for easier plotting \navg_percent_N_complete <- avg_percent_N_complete %>% \nmutate(month = factor(month, levels = c(\"January\",\"May\",\"July\")))\n\nprint(avg_percent_N_complete)\n\n\n# A tibble: 15 × 3\n   Habitat       avg_percent_N month  \n   <chr>                 <dbl> <fct>  \n 1 Bay                   0.59  January\n 2 Fringing reef         0.453 January\n 3 Mid lagoon            0.400 January\n 4 Reef crest            0.395 January\n 5 Reef pass             0.437 January\n 6 Bay                   0.643 May    \n 7 Fringing reef         0.535 May    \n 8 Mid lagoon            0.493 May    \n 9 Reef crest            0.492 May    \n10 Reef pass             0.547 May    \n11 Bay                   0.667 July   \n12 Fringing reef         0.452 July   \n13 Mid lagoon            0.374 July   \n14 Reef crest            0.372 July   \n15 Reef pass             0.38  July   \n\nVisualizing the data\nFirst I will visualize the coral bleaching data using a horizontal bar chart.\n\n\nShow code\n\n# Plot the coral bleaching data and reorder 'Island_shore' by decreasing value of 'Avg_percent_bleached'\nbleach_plot <- ggplot(data = avg_percent_bleached, aes(x = reorder(Island_shore, Avg_percent_bleached), \n                                        y = Avg_percent_bleached,\n                                        fill = Habitat)) +\n  geom_bar(stat = \"identity\", position = position_dodge()) +\n  scale_fill_brewer(palette = \"Paired\") +\n  labs(y = \"Average Percent Bleached (%)\", \n       x = \"Island Shore\", \n       title = \"Average Percent of Colony Level Coral Bleaching\nfor Moorea, French Polynesia in 2016\") + coord_flip() +\n  theme_bw()\n\n# View the plot\nbleach_plot \n\n\n\n\nThe main message of my this visualization is to communicate that: 1) The average percent of colony level coral bleaching was highest overall in the Lagoon habitat. 2) The average percent of colony level coral bleaching decreased from highest to lowest on the North, Southwest, and Southeast shore respectively in Moorea, French Polynesia.\nFirst, I want the audience to recognize that there are two habitat types (Fringe and Lagoon) that they will be comparing between, which is why I colored them in dark blue and light blue to increase their visual salience. Next, I want it to be easy for the audience to compare the average percent bleaching between the three sides of Moorea, which is why I used a horizontal bar chart because they are used often in data visualization and take relatively little effort to understand.\nI chose to align the bars in order of decreasing average percent bleached for each habitat type. This natural ordering allows the audience to easily compare the percent bleaching for different sides of the island. I also included the visual variable of color hue, specifically dark blue and light blue because they easily differentiate the two habitats from each other and are visually appealing.\nCompared to my visualization in R, I thought that my Tableau visualization did a good job of differentiating the big picture differences in average percent bleaching between the two habitat types. However, I believe my Tableau visualization didn’t compare the average percent bleaching between island shores as well as my visualization in R. The bars for each island shore are not side by side, which makes it harder for the audience to determine which shoreline had the highest percent bleaching. Overall, I think that visualizing this data in R allowed me to better represent the data and create a more effective visualization for informing a wide audience. Also, unlike Tableau, RMarkdown allowed me to easily document how I created my visualizations, which promotes reproducibility.\nTableau visualization of Average Percent of Colony Level Coral Bleaching for Moorea, French Polynesia in 2016.Next, I will visualize the average percent nitrogen in Turbinaria ornata around Moorea, French polynesia in January, May, and July 2016.\n\n\nShow code\n\n# Plot the nitrogen concentration data and reorder 'Habitat' by decreasing value of 'avg_percent_N'\nnitrogen_plot <- ggplot(data = avg_percent_N_complete, aes(x = month,\n                                                           y = avg_percent_N,\n                                                           fill = reorder(Habitat, -avg_percent_N))) +\n  geom_bar(stat = \"identity\", position = position_dodge()) +\n  labs(y = \"Average Percent Nitrogen (%)\", \n       x = \"Month\", \n       title = \"Average Percent Nitrogen in Turbinaria ornata Collected at 190 Sites\naround Moorea, French Polynesia during January, May, and August 2016\") +\n  theme_bw() +\n  scale_fill_discrete(name = \"Habitat\")\n\n# View the plot\nnitrogen_plot\n\n\n\n\nThe main message of this visualization is to communicate that the average percent nitrogen in Turbinaria ornata was highest in the bay habitat of Moorea in January, May, and July and that the average percent nitrogen increased in all the habitats in May compared to January and July.\nI used a vertical bar chart because they are a common data visualization and make it easy for the audience to quickly see which habitat has the greatest average percent nitrogen, which has the smallest, and see the incremental difference between habitats. A visual variable that I chose to include in my visualization is regular arrangement, in which the bars are aligned left to right in order of decreasing average percent nitrogen. This helps the audience know which way to read the information on the bar chart and allows them to easily compare the different habitat types.\nCompared to my visualization in R, I believe my Tableau visualization didn’t compare the average percent bleaching between months as well as my visualization in R. Stacking the bar charts on top of each other makes it difficult for the audience to compare the average percent nitrogen between different months. However grouping the bars together for each month makes it much easier to visually compare the average percent nitrogen btween different habitats and months.\nTableau visualization of Average Percent Nitrogen in Turbinaria ornata Collected at 190 Sites around Moorea, French Polynesia during January, May, and August 2016Final Thoughts on Visualizations in R vs. Tableau\nOverall, I think that visualizing this data in R allowed me to better represent the data and create a more effective visualization for informing a broader audience. However, my lack of experience with using Tableau likely resulted in my bias towards R. I think Tableau is a great way to make quick visualizations for folks who are unfamiliar with coding, but I think a major benefit that Tableau lacks is reproducibility of your work. Unlike Tableau, RMarkdown allowed me to easily document how I created my visualizations, which allows the audience to reproduce my visualizations on their own.\nEXTRA - Exporting the data for visualizing data in Tableau\nI created a .csv file of my coral bleaching and nitrogen content data so that I could visualize this data in Tableau. However, Tableau does have its own data prep software called ‘Tableau prep’. (I commented out this code chunk because I don’t want to make duplicates)\n\n\nShow code\n\n# Use write.csv to Export the DataFrame\n\n# write.csv(avg_percent_bleached,\"/Users/charleshendrickson/Downloads/avg_percent_bleached.csv\", row.names = FALSE)\n\n# write.csv(avg_percent_N_complete,\"/Users/charleshendrickson/Downloads/avg_percent_N.csv\", row.names = FALSE)\n\n\n\n\n\n\n",
    "preview": "posts/2022-01-25-data-visualization-with-tableau/data-visualization-with-tableau_files/figure-html5/unnamed-chunk-10-1.png",
    "last_modified": "2022-02-13T12:04:05-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-02-juvenile-chinook-salmon-project/",
    "title": "Water Temperature and Juvenile Chinook Salmon Fork Length in The San Francisco Estuary",
    "description": "Investigating whether the mean fork length of juvenile Chinook salmon in the San Francisco Estuary differs at sample sites with colder mean water temperatures compared to warmer mean water temperatures.",
    "author": [
      {
        "name": "Charles Hendrickson",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [],
    "contents": "\nResearch Question\nThe aim of this project is to investigate whether the mean fork length of juvenile Chinook salmon in the San Francisco Estuary differs at sample sites with colder mean water temperatures compared to warmer mean water temperatures.\nIntroduction\nChinook salmon Oncorhynchus tshawytscha are anadromous fish, which means they are born in freshwater rivers and migrate as juveniles to saltwater to feed, grow, and mature before returning to freshwater to spawn (NOAA Fisheries). They are vulnerable to many anthropogenic stressors, such as habitat degradation, blocked access to spawning grounds, and loss of genetic diversity from hatcheries. A particularly concerning stressor for Chinook salmon are changes in freshwater thermal regimes due to simplification of the physical structure of aquatic systems, reduced shading from the removal of riparian vegetation, and altered flow regimes from climate change and water diversion. (Richter & Kolmes, 2005). In a study that investigated the effects of three temperature regimes on juvenile Chinook salmon growth, it was found that juveniles reared at an elevated temperature range of 21–24°C experienced significantly decreased growth rates compared with juveniles reared at 13–16°C (Marine & Cech Jr, 2004). Furthermore, studies have found that juvenile Chinook salmon length is positively correlated with the survival and survival was markedly low among the smallest length class (that is, 80 mm to 89 mm) of subyearling Chinook salmon (Brown, Oldenburg & Seaburg et al., 2013). As California’s Chinook salmon populations become increasingly threatened by changes in freshwater thermal regimes and with increasing evidence suggesting that juvenile Chinook Salmon survival could be negatively impacted by decreased fork length, it is necessary to understand how the size of out-migrating juvenile Chinook salmon in the San Francisco Estuary may be impacted by the water temperature of their native rivers.\nWhile previous studies have used controlled laboratory experiments to test the effects of water temperature on Chinook salmon growth, I will use a long-term fish monitoring dataset in my analysis to quantify the impact of mean water temperature on the mean fork length of juvenile Chinook salmon.\nData Description and Collection\nI downloaded Interagency Ecological Program (IEP) survey data from the Environmental Data Initiative (EDI) Data Portal.\nInteragency Ecological Program survey data\nThe IEP survey data contains over four decades (1976-2021) of juvenile fish monitoring data from the San Francisco Estuary, collected by the The United States Fish and Wildlife Service Delta Juvenile Fish Monitoring Program (DJFMP). As part of the IEP that manages the San Francisco Estuary, the DJFMP has tracked the relative abundance and distribution of naturally and hatchery produced juvenile Chinook Salmon of all races as they out-migrate through the Sacramento-San Joaquin Delta using a combination of surface trawls and beach seines. Since 2000, three trawl sites and 58 beach seine sites have been sampled weekly or biweekly within the San Francisco Estuary and lower Sacramento and San Joaquin Rivers.\nThe DJFMP data set contains columns of the sample site location, date, time, sample method, environmental conditions, water temp, species, fish count, and fork length. Each row represents a sample of one or multiple fish (must have the same fork length) at a distinct site and time. The strengths of this data set are that the sample size is very large and it has ample metadata. The limitations of this data set are that its samples were not taken continuously prior to 1995 so there are gaps in the data. After 1995 samples were taken year-round to the expand the temporal monitoring of fish. Also the data set is not already in tidy format because each row does not represent one fish. For example, the ‘Count’ column contains the count of fish with the same fork length per sample date, which should each be separate rows. The full metadata can be found here.\nThe variables that I am interested in for my analysis are fork length (mm) and water temperature (degrees Celsius).\nFork Length\nFork length is the length of sampled fish measured from the point of the mouth to the fork of the caudal fin. Fish were measured to the nearest 1 mm before being released. Generally, all fish in each sample that were ≥ 25 mm fork length were identified by species.\n\n\nShow code\n\n# URL of data set: https://portal.edirepository.org/nis/metadataviewer?packageid=edi.244.8\n\n# Import data and convert it to a data frame\nDJFMP_df <- as.data.frame(read.csv(here(\"../data/1976-2021_DJFMP_beach_seine_fish_and_water_quality_data.csv\")))\n\n\n\n\n\nShow code\n\n# Filter data set for just Chinook salmon (CHN) observations \nDJFMP_CHN_df <- DJFMP_df %>% \n  filter(OrganismCode == 'CHN') %>% \n  select(Location, SampleDate, ForkLength, WaterTemp, MethodCode, Count) %>% \n  uncount(Count) %>%\n  mutate(SampleDate = as.Date(SampleDate))\n\n# Drop NA's from WaterTemp column\nDJFMP_CHN_df <- DJFMP_CHN_df[!is.na(DJFMP_CHN_df$WaterTemp),]\n\n\n\n\n\nShow code\n\n# Check for outliers\nlarge_outliers <- DJFMP_CHN_df %>% \n  filter(ForkLength > 250)\n\nsmall_outliers <- DJFMP_CHN_df %>% \n  filter(ForkLength <= 0)\n\n# Remove these data points because juvenile Chinook salmon cannot have a fork length of zero mm and we only want data on juvenile Chinook salmon that are below 250 mm in length, not adults. \nDJFMP_CHN_df <- DJFMP_CHN_df %>% \n  filter(ForkLength != 0 & ForkLength < 250)\n\n\n\n\n\nShow code\n\n# This data frame contains each Location's means fork length and water temp.\nDJFMP_CHN_df_mean <- DJFMP_CHN_df %>% \n          group_by(Location) %>% \n          summarise(\n            mean_fork_length = mean(ForkLength), \n            mean_water_temp = mean(WaterTemp)) \n\n\n\n\n\nShow code\n\n# Plot juvenile Chinook salmon fork length over time\nggplot(data = DJFMP_CHN_df, aes(x = SampleDate, y = ForkLength)) +\n  geom_point() +\n  labs(title = \"Fork Length of Juvenile Chinook Salmon in \nSan Francisco Estuary (1976-2021)\",\n       x = \"Date\",\n       y = \"Fork Length (mm)\") +\n  theme_classic()\n\n\n\n\nFigure 1: Fork length of juvenile Chinook salmon in San Francisco Estuary from 1976 to 2021.\n\n\n\nWater Temperature\nThe YSI PRO 2030 Meter was used to measure water temperature before or after each fish sample. Water temperature was recorded to the nearest 0.1˚C.\n\n\nShow code\n\n# Plot water temperature over time\nggplot(data = DJFMP_CHN_df, aes(x = SampleDate, y = WaterTemp)) +\n  geom_point() +\n  labs(title = \"Water Temperature Across Sample Sites in \nSan Francisco Estuary (1976-2021)\",\n       x = \"Date\",\n       y = \"Water Temperature (degrees Celsius)\") +\n  theme_classic()\n\n\n\n\nFigure 2: Water Temperature at sample sites in San Francisco Estuary from 1976 to 2021.\n\n\n\nAnalysis\nI will conduct a hypothesis test to determine if there is a difference in the mean fork length of juvenile Chinook salmon across sites with warmer mean water temperatures compared to sites with colder mean water temperatures in the San Francisco Estuary. Specifically, I will use a linear regression to see if mean water temperature affects mean fork length.\nFirst, I will define my null and alternative hypotheses. Second, I will collect and filter my data for location, sample date, fork length, water temperature, method code, and count. The data must be in tidy format so I will use the uncount() function to turn the ‘Count’ column into duplicate rows so that each row represents one observation. To clean the data I will drop NA values from the water temperature column and exclude any adult Chinook salmon samples by removing fork length values greater than 250mm. I will also remove all fork length values of zero mm because these are faulty samples that do not represent real fish.\nThird, I will visualize the general relationship between water temperature and fork length before beginning my analysis on the relationship between mean water temperature and mean fork length. I think it is important to get a understanding of the raw data and show where the majority of the data lies.\nFourth, I will then compute the point estimate by: 1) Calculating the mean water temperature across all samples in the data. 2) Calculating the mean water temperature and mean fork length of each site/location. 3) Filtering for sites with mean water temperature above or below the mean water temperature across all samples (gives us warm water and cold water sites). 4) Taking the difference between the mean fork length of the warm water sites and the mean fork length of cold water sites.\nThis will give me the difference between the mean fork length of juvenile Chinook salmon that are reared in warmer mean water temperatures compared to colder mean water temperatures.\nFifth, I will conduct a t-test to measure the variability of the sample statistic and ensure that my point estimate is not just a difference in the samples due to random variability. Sixth, I will run a linear regression of mean water temperature on mean fork length. Finally, based on my p-value, I will reject or fail to reject my null hypothesis.\nLimitations\nA limitation of my analysis is that water temperature is the only independent variable included in the model, which means this analysis is vulnerable to omitted variables bias. It is very likely that there are many different abiotic and biotic factors in addition to water temperature that influence juvenile Chinook salmon fork length.\nHypotheses\nNull Hypothesis \\[H_{0}: \\mu_{ForkLengthCold} - \\mu_{ForkLengthWarm} = 0\\]\nAlternative hypothesis \\[H_{A}: \\mu_{ForkLengthCold} - \\mu_{ForkLengthWarm} \\neq 0\\]\nVisualize data\nScatter plot showing changes in juvenile Chinook salmon fork length (\\(y\\)-axis) as it relates to water temperature (\\(x\\)-axis).\n\n\nShow code\n\nforklength_vs_watertemp <- ggplot(data = DJFMP_CHN_df, \n                                  aes(x = WaterTemp, \n                                      y = ForkLength)) +\n  geom_point(size = 1) +\n  labs(title = \"Relationship Between Juvenile Chinook Salmon Fork Length \nand Water Temperature\",\n       x = \"Water Temperature (°C)\",\n       y = \"Fork Length (mm)\") +\n  theme_bw()\n\nforklength_vs_watertemp\n\n\n\n\nFigure 3: Juvenile Chinook salmon fork length as it relates to water temperature at sample sites in the San Francisco Estuary from 1976 to 2021.\n\n\n\nDensity plot of juvenile Chinook salmon fork length (\\(y\\)-axis) as it relates to water temperature (\\(x\\)-axis).\n\n\nShow code\n\n# Determine where data density is relatively high versus low\nforklength_vs_watertemp_alpha <- ggplot(data = DJFMP_CHN_df, \n                                        aes(x = WaterTemp, \n                                            y = ForkLength)) +\n  geom_point(alpha=0.1, size=1) +\n  labs(title = \"Relationship Between Juvenile Chinook Salmon Fork Length\nand Water Temperature\",\n       x = \"Water Temperature (°C)\",\n       y = \"Fork Length (mm)\") +\n  theme_bw() \n\nforklength_vs_watertemp_alpha\n\n\n\n\nFigure 4: The density of juvenile Chinook salmon fork lengths as it relates to water temperature at sample sites in the San Francisco Estuary from 1976 to 2021.\n\n\n\nHeat map with geom_bin2d() of juvenile Chinook salmon fork length (\\(y\\)-axis) as it relates to water temperature (\\(x\\)-axis).\n\n\nShow code\n\nforklength_vs_watertemp_density <- ggplot(data = DJFMP_CHN_df, \n                                  aes(x = WaterTemp, \n                                      y = ForkLength)) +\n  geom_bin2d(bins = 60) +\n  labs(title = \"Relationship Between Juvenile Chinook Salmon Fork Length \nand Water Temperature\",\n       x = \"Water Temperature (°C)\",\n       y = \"Fork Length (mm)\") +\n  theme_bw()\n\nforklength_vs_watertemp_density\n\n\n\n\nFigure 5: Heat map of juvenile Chinook salmon fork length as it relates to water temperature at sample sites in the San Francisco Estuary from 1976 to 2021.\n\n\n\nResults\n\n\nShow code\n\n# Mean water temp of all sites \nmean_water_temp_overall <- mean(DJFMP_CHN_df$WaterTemp)\n\n\n# Warm water sites\nwarm_areas <- DJFMP_CHN_df %>% \n          group_by(Location) %>% \n          summarise(ForkLength, mean_water_temp = mean(WaterTemp)) %>% \n  filter(mean_water_temp > mean_water_temp_overall) %>%\n  summarise(mean_fork_length = mean(ForkLength))\n        \n\n# Remove Veale Tract because it is an outlier\nwarm_mean <- warm_areas %>% \n  filter(Location != \"Veale Tract\") %>%\n  summarise(mean(mean_fork_length))\n\nwarm_mean <- as.numeric(warm_mean)\n  \n\n# Cold water sites\ncold_areas <- DJFMP_CHN_df %>% \n          group_by(Location) %>% \n          summarise(ForkLength, mean_water_temp = mean(WaterTemp)) %>% \n  filter(mean_water_temp < mean_water_temp_overall) %>%\n  summarise(mean_fork_length = mean(ForkLength))\n\n\ncold_mean <- cold_areas %>%\n  summarise(mean(mean_fork_length))\n\ncold_mean <- as.numeric(cold_mean)\n\n\n# Difference in mean fork lengths for cold water sites vs. warm water sites \npoint_est = as.numeric(warm_mean - cold_mean)\nprint(paste0(\"The point estimate is \", point_est ,\"mm.\"))\n\n\n[1] \"The point estimate is 2.09782423716582mm.\"\n\n\\[PointEstimate =  {MeanForkLengthWarm} - {MeanForkLengthCold}\\] The point estimate for the difference in mean fork lengths for sites with warmer mean water temperatures versus colder mean water temperatures is 2.097824mm. However, this value could just be a difference in the samples due to random variability. Thus, I must calculate a measure of variability using a t-test.\n\n\nShow code\n\n# Just get the sample size (n) for the warm group \nn1 = warm_areas  %>% count()\n# Just get the sample size (n) for the cold group\nn2 = cold_areas %>% count()\n# Get the standard deviation for the warm variable (mean fork length) which we are interested in.\ns1 = warm_areas %>% summarize(sd(mean_fork_length, na.rm = TRUE))\n# Get the standard deviation for the cold variable (mean fork length) which we are interested in.\ns2 = cold_areas %>% summarize(sd(mean_fork_length, na.rm = TRUE))\n\n# Compute the standard error.\n# as.numeric makes it a value instead of a data point. \nSE = as.numeric(sqrt(s1^2/n1 + s2^2/n2))\n\n\n\n\n\nShow code\n\n# And now the test statistic:\nzscore = (point_est - 0)/SE\nprint(paste0(\"The test statistic (z-score) is \", zscore ,\"\"))\n\n\n[1] \"The test statistic (z-score) is 0.934362800214626\"\n\nShow code\n\n# The observed mean fork lengths are 0.9343628 standard deviations away from our null hypothesis. \n\n\n\n\n\nShow code\n\ncrit_val = qnorm(0.025, lower.tail=FALSE)\n\n\n\n\n\nShow code\n\n# Now we can construct the 95% confidence interval:\nci_lower = round(point_est - crit_val*SE, 2)\nci_upper = round(point_est + crit_val*SE, 2)\n\nprint(paste0(\"95% probability that [\", ci_lower, \", \", ci_upper, \"] contains the difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures.\"))\n\n\n[1] \"95% probability that [-2.3, 6.5] contains the difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures.\"\n\nThe test statistic (z-score) tells us that the observed difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures is 0.9343628 standard deviations above the null hypothesis of zero difference.\nThe 95% confidence interval tells us that there is a 95% probability that [-2.3, 6.5] contains the difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures.\n\n\nShow code\n\nlibrary(modelr)\n\n# regression\nmodel_1 <- lm(mean_fork_length ~ mean_water_temp, data = DJFMP_CHN_df_mean)\n\n# create predictions and residuals\npredictions <- DJFMP_CHN_df_mean %>% add_predictions(model_1) %>%\n  mutate(residuals = mean_fork_length - pred)\n\n# histogram\nggplot(data = predictions) + geom_histogram(aes(residuals), bins=25) +\n  labs(title = \"Residual Distribution\") +\n  theme_classic()\n\n\n\n\nFigure 6: The distribution of residuals for water temperature on juvenile Chinook salmon fork length.\n\n\n\nThe residuals appear to be roughly mean zero based on the histogram above, but there is a long right tail due to outliers in the residuals distribution, so it is definitely not a perfectly normal distribution.\nNext I will quantify the probability that the sample statistic differs from the null by using the lm() command to estimate the following simple linear regression:\n\\[ \\text{mean fork length}_i = \\beta_0 + \\beta_1 \\text{mean water temperature}_i + \\varepsilon_i \\]\n\n\nShow code\n\nlm(mean_fork_length ~ mean_water_temp, data = DJFMP_CHN_df_mean) %>% \n  summary()%>% \n  xtable() %>% \n  kable(caption = \"Table 1: Linear Regression of Mean Water Temperature on \n        Mean Fork Length of Juvenile Chinook Salmon\")\n\n\nTable 1: Table 1: Linear Regression of Mean Water Temperature on Mean Fork Length of Juvenile Chinook Salmon\n\nEstimate\nStd. Error\nt value\nPr(>|t|)\n(Intercept)\n-11.968201\n10.3452215\n-1.156882\n0.2519831\nmean_water_temp\n4.944056\n0.8334126\n5.932303\n0.0000002\n\nThe p-value is much lower than 0.05, so we can reject the null hypothesis that there is no effect of water temperature on mean fork length.\nIntercept: On average, the predicted mean fork length of a juvenile Chinook salmon raised in zero degree Celsius water is -11.968201 (mm).\nCoefficient on water temperature (WaterTemp): On average, the predicted mean fork length of juvenile Chinook salmon increases by 4.944056 (mm) for every one degree Celsius increase in water temperature.\nR-squared: Our coefficient of determination (\\(R^2\\)) was 0.02533, which tells us that 2.53% of the variation in the mean fork length of juvenile Chinook salmon is explained by the mean water temperature at the site. This is expected because there are many factors in addition to water temperature that play a role in determining the mean fork length of juvenile Chinook salmon.\n\n\nShow code\n\nforklength_vs_watertemp <- ggplot(data = DJFMP_CHN_df_mean, \n                                  aes(x = mean_water_temp, \n                                      y = mean_fork_length)) +\n  geom_point() +\n  geom_smooth(method = 'lm', formula= y~x, se=FALSE, size=1) +\n  labs(title = \"Relationship Between Juvenile Chinook Salmon Mean Fork Length\nand Mean Water Temperature\",\n       x = \"Mean Water Temperature (°C) \",\n       y = \"Mean Fork Length (mm)\") +\n  theme_bw()\n\nforklength_vs_watertemp\n\n\n\n\nFigure 7: A linear regression of the relationship between mean water temperature and mean fork length of juvenile Chinook salmon in the San Francisco Estuary from 1976 to 2021.\n\n\n\nFrom our linear regression line, we can see the increase in the mean fork length of juvenile Chinook salmon as the mean water temperature increases.\nSince \\(p-value = 1.675e-07 < 0.05\\) we reject the null that there is no difference in the mean fork length of juvenile Chinook salmon at sites with colder mean water temperatures compared to sites with warmer mean water temperatures. We can say there is a statistically significant difference (at the 5% significance level) in the mean fork length of juvenile Chinook salmon across sites with colder mean water temperatures compared to sites with warmer mean water temperatures.\nConclusion and Next Steps\nBased on the findings of my analysis, the mean fork length of juvenile Chinook salmon in the San Francisco Estuary does significantly differ at sample sites with colder mean water temperatures compared to warmer mean water temperatures.\nIn future analyses, I would investigate the difference the mean fork length of juvenile Chinook salmon at sites with high nutrient levels versus sites with low nutrient levels. Nutrient levels play a key role in determining the growth rate of juvenile Chinook salmon because insects and other food sources are often more abundant in rivers with warmer water water temperatures than colder water temperatures. Additionally, using a multiple linear regression to investigate the role that nutrient levels and water temperature have on the mean fork length of juvenile Chinook salmon could provide valuable information for the conservation and management of this threatened species.\nGithub\nThe repository containing all of the code and data for this analysis can be found here.\nReferences\nInteragency Ecological Program (IEP), R. McKenzie, J. Speegle, A. Nanninga, J.R. Cook, and J. Hagen. 2021. Interagency Ecological Program: Over four decades of juvenile fish monitoring data from the San Francisco Estuary, collected by the Delta Juvenile Fish Monitoring Program, 1976-2021 ver 8. Environmental Data Initiative. https://doi.org/10.6073/pasta/8dfe5eac4ecf157b7b91ced772aa214a (Accessed 2021-11-30).\nAnn Richter & Steven A. Kolmes (2005) Maximum Temperature Limits for Chinook, Coho, and Chum Salmon, and Steelhead Trout in the Pacific Northwest, Reviews in Fisheries Science, 13:1, 23-49, DOI: 10.1080/10641260590885861\nKeith R. Marine & Joseph J. Cech Jr (2004) Effects of High Water Temperature on Growth, Smoltification, and Predator Avoidance in Juvenile Sacramento RiverChinook Salmon, North American Journal of Fisheries Management, 24:1, 198-210, DOI: 10.1577/M02-142\nBrown, R.S., Oldenburg, E.W., Seaburg, A.G. et al. Survival of seaward-migrating PIT and acoustic-tagged juvenile Chinook salmon in the Snake and Columbia Rivers: an evaluation of length-specific tagging effects. Anim Biotelemetry 1, 8 (2013). https://doi.org/10.1186/2050-3385-1-8\nNOAA Fisheries, Chinook Salmon (2021). https://www.fisheries.noaa.gov/species/chinook-salmon-protected#overview\n\n\n\n",
    "preview": "posts/2021-12-02-juvenile-chinook-salmon-project/juvenile-chinook-salmon-project_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2022-01-25T14:46:07-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-10-a-function-i-learned/",
    "title": "Climate Resilient Coral Modeling (CRCM)",
    "description": "For my class EDS220: Remote Sensing and Environmental Data, my team members and I are investigating how to predict heat stress and bleaching levels of heat tolerant corals in Honoliʻi, Hawaiʻi under three different future sea surface temperature scenarios. Using the NOAA Coral Reef Watch Dataset, our team will explore the hypothesis that a symbiotic relationship exists between corals and algae in Honoliʻi that allows the corals to survive in waters 1.5 degrees celsius above the normal bleaching threshold. Modeling the response of heat resistant corals to warming sea surface temperatures will help inform coral reef conservation strategies and policies in Honoliʻi that can potentially be applied throughout Hawaiʻi.",
    "author": [
      {
        "name": "Charles Hendrickson",
        "url": {}
      }
    ],
    "date": "2021-11-08",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-02T16:47:52-08:00",
    "input_file": {}
  }
]
