[
  {
    "path": "posts/2021-12-02-juvenile-chinook-salmon-project/",
    "title": "Water Temperature and Juvenile Chinook Salmon Fork Length in The San Francisco Estuary",
    "description": "Investigating whether the mean fork length of juvenile Chinook salmon in the San Francisco Estuary differs at sample sites with colder mean water temperatures compared to warmer mean water temperatures.",
    "author": [
      {
        "name": "Charles Hendrickson",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [],
    "contents": "\nResearch Question\nThe aim of this project is to investigate whether the mean fork length of juvenile Chinook salmon in the San Francisco Estuary differs at sample sites with colder mean water temperatures compared to warmer mean water temperatures.\nIntroduction\nChinook salmon Oncorhynchus tshawytscha are anadromous fish, which means they are born in freshwater rivers and migrate as juveniles to saltwater to feed, grow, and mature before returning to freshwater to spawn (NOAA Fisheries). They are vulnerable to many anthropogenic stressors, such as habitat degradation, blocked access to spawning grounds, and loss of genetic diversity from hatcheries. A particularly concerning stressor for Chinook salmon are changes in freshwater thermal regimes due to simplification of the physical structure of aquatic systems, reduced shading from the removal of riparian vegetation, and altered flow regimes from climate change and water diversion. (Richter & Kolmes, 2005). In a study that investigated the effects of three temperature regimes on juvenile Chinook salmon growth, it was found that juveniles reared at an elevated temperature range of 21–24°C experienced significantly decreased growth rates compared with juveniles reared at 13–16°C (Marine & Cech Jr, 2004). Furthermore, studies have found that juvenile Chinook salmon length is positively correlated with the survival and survival was markedly low among the smallest length class (that is, 80 mm to 89 mm) of subyearling Chinook salmon (Brown, Oldenburg & Seaburg et al., 2013). As California’s Chinook salmon populations become increasingly threatened by changes in freshwater thermal regimes and with increasing evidence suggesting that juvenile Chinook Salmon survival could be negatively impacted by decreased fork length, it is necessary to understand how the size of out-migrating juvenile Chinook salmon in the San Francisco Estuary may be impacted by the water temperature of their native rivers.\nWhile previous studies have used controlled laboratory experiments to test the effects of water temperature on Chinook salmon growth, I will use a long-term fish monitoring dataset in my analysis to quantify the impact of mean water temperature on the mean fork length of juvenile Chinook salmon.\nData Description and Collection\nI downloaded Interagency Ecological Program (IEP) survey data from the Environmental Data Initiative (EDI) Data Portal.\nInteragency Ecological Program survey data\nThe IEP survey data contains over four decades (1976-2021) of juvenile fish monitoring data from the San Francisco Estuary, collected by the The United States Fish and Wildlife Service Delta Juvenile Fish Monitoring Program (DJFMP). As part of the IEP that manages the San Francisco Estuary, the DJFMP has tracked the relative abundance and distribution of naturally and hatchery produced juvenile Chinook Salmon of all races as they out-migrate through the Sacramento-San Joaquin Delta using a combination of surface trawls and beach seines. Since 2000, three trawl sites and 58 beach seine sites have been sampled weekly or biweekly within the San Francisco Estuary and lower Sacramento and San Joaquin Rivers.\nThe DJFMP data set contains columns of the sample site location, date, time, sample method, environmental conditions, water temp, species, fish count, and fork length. Each row represents a sample of one or multiple fish (must have the same fork length) at a distinct site and time. The strengths of this data set are that the sample size is very large and it has ample metadata. The limitations of this data set are that its samples were not taken continuously prior to 1995 so there are gaps in the data. After 1995 samples were taken year-round to the expand the temporal monitoring of fish. Also the data set is not already in tidy format because each row does not represent one fish. For example, the ‘Count’ column contains the count of fish with the same fork length per sample date, which should each be separate rows. The full metadata can be found here.\nThe variables that I am interested in for my analysis are fork length (mm) and water temperature (degrees Celsius).\nFork Length\nFork length is the length of sampled fish measured from the point of the mouth to the fork of the caudal fin. Fish were measured to the nearest 1 mm before being released. Generally, all fish in each sample that were ≥ 25 mm fork length were identified by species.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFigure 1: Fork length of juvenile Chinook salmon in San Francisco Estuary from 1976 to 2021.\n\n\n\nWater Temperature\nThe YSI PRO 2030 Meter was used to measure water temperature before or after each fish sample. Water temperature was recorded to the nearest 0.1˚C.\n\n\n\nFigure 2: Water Temperature at sample sites in San Francisco Estuary from 1976 to 2021.\n\n\n\nAnalysis\nI will conduct a hypothesis test to determine if there is a difference in the mean fork length of juvenile Chinook salmon across sites with warmer mean water temperatures compared to sites with colder mean water temperatures in the San Francisco Estuary. Specifically, I will use a linear regression to see if mean water temperature affects mean fork length.\nFirst, I will define my null and alternative hypotheses. Second, I will collect and filter my data for location, sample date, fork length, water temperature, method code, and count. The data must be in tidy format so I will use the uncount() function to turn the ‘Count’ column into duplicate rows so that each row represents one observation. To clean the data I will drop NA values from the water temperature column and exclude any adult Chinook salmon samples by removing fork length values greater than 250mm. I will also remove all fork length values of zero mm because these are faulty samples that do not represent real fish.\nThird, I will visualize the general relationship between water temperature and fork length before beginning my analysis on the relationship between mean water temperature and mean fork length. I think it is important to get a understanding of the raw data and show where the majority of the data lies.\nFourth, I will then compute the point estimate by: 1) Calculating the mean water temperature across all samples in the data. 2) Calculating the mean water temperature and mean fork length of each site/location. 3) Filtering for sites with mean water temperature above or below the mean water temperature across all samples (gives us warm water and cold water sites). 4) Taking the difference between the mean fork length of the warm water sites and the mean fork length of cold water sites.\nThis will give me the difference between the mean fork length of juvenile Chinook salmon that are reared in warmer mean water temperatures compared to colder mean water temperatures.\nFifth, I will conduct a t-test to measure the variability of the sample statistic and ensure that my point estimate is not just a difference in the samples due to random variability. Sixth, I will run a linear regression of mean water temperature on mean fork length. Finally, based on my p-value, I will reject or fail to reject my null hypothesis.\nLimitations\nA limitation of my analysis is that water temperature is the only independent variable included in the model, which means this analysis is vulnerable to omitted variables bias. It is very likely that there are many different abiotic and biotic factors in addition to water temperature that influence juvenile Chinook salmon fork length.\nHypotheses\nNull Hypothesis \\[H_{0}: \\mu_{ForkLengthCold} - \\mu_{ForkLengthWarm} = 0\\]\nAlternative hypothesis \\[H_{A}: \\mu_{ForkLengthCold} - \\mu_{ForkLengthWarm} \\neq 0\\]\nVisualize data\nScatter plot showing changes in juvenile Chinook salmon fork length (\\(y\\)-axis) as it relates to water temperature (\\(x\\)-axis).\n\n\n\nFigure 3: Juvenile Chinook salmon fork length as it relates to water temperature at sample sites in the San Francisco Estuary from 1976 to 2021.\n\n\n\nDensity plot of juvenile Chinook salmon fork length (\\(y\\)-axis) as it relates to water temperature (\\(x\\)-axis).\n\n\n\nFigure 4: The density of juvenile Chinook salmon fork lengths as it relates to water temperature at sample sites in the San Francisco Estuary from 1976 to 2021.\n\n\n\nHeat map with geom_bin2d() of juvenile Chinook salmon fork length (\\(y\\)-axis) as it relates to water temperature (\\(x\\)-axis).\n\n\n\nFigure 5: Heat map of juvenile Chinook salmon fork length as it relates to water temperature at sample sites in the San Francisco Estuary from 1976 to 2021.\n\n\n\nResults\n\n[1] \"The point estimate is 2.09782423716582mm.\"\n\n\\[PointEstimate =  {MeanForkLengthWarm} - {MeanForkLengthCold}\\] The point estimate for the difference in mean fork lengths for sites with warmer mean water temperatures versus colder mean water temperatures is 2.097824mm. However, this value could just be a difference in the samples due to random variability. Thus, I must calculate a measure of variability using a t-test.\n\n\n\n\n[1] \"The test statistic (z-score) is 0.934362800214626\"\n\n\n\n\n\n[1] \"95% probability that [-2.3, 6.5] contains the difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures.\"\n\nThe test statistic (z-score) tells us that the observed difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures is 0.9343628 standard deviations above the null hypothesis of zero difference.\nThe 95% confidence interval tells us that there is a 95% probability that [-2.3, 6.5] contains the difference in mean fork lengths of juvenile Chinook salmon for sites with warmer mean water temperatures versus sites with colder mean water temperatures.\n\n\n\nFigure 6: The distribution of residuals for water temperature on juvenile Chinook salmon fork length.\n\n\n\nThe residuals appear to be roughly mean zero based on the histogram above, but there is a long right tail due to outliers in the residuals distribution, so it is definitely not a perfectly normal distribution.\nNext I will quantify the probability that the sample statistic differs from the null by using the lm() command to estimate the following simple linear regression:\n\\[ \\text{mean fork length}_i = \\beta_0 + \\beta_1 \\text{mean water temperature}_i + \\varepsilon_i \\]\n\nTable 1: Table 1: Linear Regression of Mean Water Temperature on Mean Fork Length of Juvenile Chinook Salmon\n\nEstimate\nStd. Error\nt value\nPr(>|t|)\n(Intercept)\n-11.968201\n10.3452215\n-1.156882\n0.2519831\nmean_water_temp\n4.944056\n0.8334126\n5.932303\n0.0000002\n\nThe p-value is much lower than 0.05, so we can reject the null hypothesis that there is no effect of water temperature on mean fork length.\nIntercept: On average, the predicted mean fork length of a juvenile Chinook salmon raised in zero degree Celsius water is -11.968201 (mm).\nCoefficient on water temperature (WaterTemp): On average, the predicted mean fork length of juvenile Chinook salmon increases by 4.944056 (mm) for every one degree Celsius increase in water temperature.\nR-squared: Our coefficient of determination (\\(R^2\\)) was 0.02533, which tells us that 2.53% of the variation in the mean fork length of juvenile Chinook salmon is explained by the mean water temperature at the site. This is expected because there are many factors in addition to water temperature that play a role in determining the mean fork length of juvenile Chinook salmon.\n\n\n\nFigure 7: A linear regression of the relationship between mean water temperature and mean fork length of juvenile Chinook salmon in the San Francisco Estuary from 1976 to 2021.\n\n\n\nFrom our linear regression line, we can see the increase in the mean fork length of juvenile Chinook salmon as the mean water temperature increases.\nSince \\(p-value = 1.675e-07 < 0.05\\) we reject the null that there is no difference in the mean fork length of juvenile Chinook salmon at sites with colder mean water temperatures compared to sites with warmer mean water temperatures. We can say there is a statistically significant difference (at the 5% significance level) in the mean fork length of juvenile Chinook salmon across sites with colder mean water temperatures compared to sites with warmer mean water temperatures.\nConclusion and Next Steps\nBased on the findings of my analysis, the mean fork length of juvenile Chinook salmon in the San Francisco Estuary does significantly differ at sample sites with colder mean water temperatures compared to warmer mean water temperatures.\nIn future analyses, I would investigate the difference the mean fork length of juvenile Chinook salmon at sites with high nutrient levels versus sites with low nutrient levels. Nutrient levels play a key role in determining the growth rate of juvenile Chinook salmon because insects and other food sources are often more abundant in rivers with warmer water water temperatures than colder water temperatures. Additionally, using a multiple linear regression to investigate the role that nutrient levels and water temperature have on the mean fork length of juvenile Chinook salmon could provide valuable information for the conservation and management of this threatened species.\nGithub\nThe repository containing all of the code and data for this analysis can be found here.\nReferences\nInteragency Ecological Program (IEP), R. McKenzie, J. Speegle, A. Nanninga, J.R. Cook, and J. Hagen. 2021. Interagency Ecological Program: Over four decades of juvenile fish monitoring data from the San Francisco Estuary, collected by the Delta Juvenile Fish Monitoring Program, 1976-2021 ver 8. Environmental Data Initiative. https://doi.org/10.6073/pasta/8dfe5eac4ecf157b7b91ced772aa214a (Accessed 2021-11-30).\nAnn Richter & Steven A. Kolmes (2005) Maximum Temperature Limits for Chinook, Coho, and Chum Salmon, and Steelhead Trout in the Pacific Northwest, Reviews in Fisheries Science, 13:1, 23-49, DOI: 10.1080/10641260590885861\nKeith R. Marine & Joseph J. Cech Jr (2004) Effects of High Water Temperature on Growth, Smoltification, and Predator Avoidance in Juvenile Sacramento RiverChinook Salmon, North American Journal of Fisheries Management, 24:1, 198-210, DOI: 10.1577/M02-142\nBrown, R.S., Oldenburg, E.W., Seaburg, A.G. et al. Survival of seaward-migrating PIT and acoustic-tagged juvenile Chinook salmon in the Snake and Columbia Rivers: an evaluation of length-specific tagging effects. Anim Biotelemetry 1, 8 (2013). https://doi.org/10.1186/2050-3385-1-8\nNOAA Fisheries, Chinook Salmon (2021). https://www.fisheries.noaa.gov/species/chinook-salmon-protected#overview\n\n\n\n",
    "preview": "posts/2021-12-02-juvenile-chinook-salmon-project/juvenile-chinook-salmon-project_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2021-12-07T16:20:12-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-10-a-function-i-learned/",
    "title": "Climate Resilient Coral Modeling (CRCM)",
    "description": "For my class EDS220: Remote Sensing and Environmental Data, my team members and I are investigating how to predict heat stress and bleaching levels of heat tolerant corals in Honoliʻi, Hawaiʻi under three different future sea surface temperature scenarios. Using the NOAA Coral Reef Watch Dataset, our team will explore the hypothesis that a symbiotic relationship exists between corals and algae in Honoliʻi that allows the corals to survive in waters 1.5 degrees celsius above the normal bleaching threshold. Modeling the response of heat resistant corals to warming sea surface temperatures will help inform coral reef conservation strategies and policies in Honoliʻi that can potentially be applied throughout Hawaiʻi.",
    "author": [
      {
        "name": "Charles Hendrickson",
        "url": {}
      }
    ],
    "date": "2021-11-08",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-02T16:47:52-08:00",
    "input_file": {}
  }
]
